Creates a new instance of a LoadNature element within the project.
  Namespace:   Autodesk.Revit.Creation
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
[ObsoleteAttribute("This method is obsolete in Revit 2016. Use LoadNature.Create() instead.")]
public LoadNature NewLoadNature(
	string name
)
  Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2016. Use LoadNature.Create() instead.")> _
Public Function NewLoadNature ( _
	name As String _
) As LoadNature
  Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2016. Use LoadNature.Create() instead.")]
public:
LoadNature^ NewLoadNature(
	String^ name
)
 Parameters
  name
 Type:  System String
 The name for the Load Nature Element to create.
 Return Value
 If successful and there isn't the Load Nature Element with the same name NewLoadNature returns an object for the newly created LoadNature. If such element exist it returns existing element.    a null reference (  Nothing  in Visual Basic)  is returned if the operation fails.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   If the product is not Revit Structure.
 See Also
  Document Class
  Autodesk.Revit.Creation Namespace